const { default: makeWASocket, BufferJSON, WA_DEFAULT_EPHEMERAL, generateWAMessageFromContent, downloadContentFromMessage, downloadHistory, proto, getMessage, generateWAMessageContent, prepareWAMessageMedia } = require('@adiwajshing/baileys')
let fs = require('fs')
let handler = async (m) => {
let krizyn = `
╭═════〘 𝗥 𝗨 𝗟 𝗘 𝗦  𝗕 𝗢 𝗧 〙═══
⬡ 𝙈𝙤𝙝𝙤𝙣 𝙪𝙣𝙩𝙪𝙠 𝙩𝙞𝙙𝙖𝙠 𝙎𝙥𝙖𝙢 𝘽𝙤𝙩 𝙠𝙖𝙧𝙚𝙣𝙖 𝘽𝙤𝙩 𝙞𝙣𝙞 𝙨𝙪𝙙𝙖𝙝 𝙢𝙚𝙢𝙞𝙡𝙞𝙠𝙞 𝙊𝙩𝙤𝙢𝙖𝙩𝙞𝙨 𝘽𝙡𝙤𝙠𝙞𝙧 𝘽𝙖𝙜𝙞 𝙋𝙚𝙣𝙜𝙜𝙪𝙣𝙖 𝘽𝙤𝙩 𝙮𝙖𝙣𝙜 𝙎𝙥𝙖𝙢
⬡ 𝙈𝙤𝙝𝙤𝙣 𝙢𝙖𝙖𝙛 𝙟𝙞𝙠𝙖 𝙖𝙙 𝙮𝙜 𝙢𝙚𝙢𝙖𝙠𝙖𝙞 𝙢𝙚𝙣𝙪 𝙉𝙨𝙛𝙬 𝙢𝙖𝙠𝙖 𝙖𝙠𝙖𝙣 𝙙𝙞 𝙗𝙡𝙤𝙘𝙠 𝙤𝙡𝙚𝙝 𝙗𝙤𝙩, 𝙟𝙞𝙠𝙖 𝙙𝙞 𝙜𝙘 𝙩𝙤𝙡𝙤𝙣𝙜 𝙖𝙙𝙢𝙞𝙣 𝙪𝙣𝙩𝙪𝙠 𝙢𝙚𝙣𝙜𝙝𝙪𝙗𝙪𝙣𝙜𝙞 𝙠𝙖𝙢𝙞!!
⬡ 𝙈𝙤𝙝𝙤𝙣 𝙪𝙣𝙩𝙪𝙠 𝙩𝙞𝙙𝙖𝙠 𝙈𝙚𝙣𝙚𝙡𝙥𝙤𝙣 𝘽𝙤𝙩 𝙠𝙖𝙧𝙚𝙣𝙖 𝘽𝙤𝙩 𝙞𝙣𝙞 𝙨𝙪𝙙𝙖𝙝 𝙢𝙚𝙢𝙞𝙡𝙞𝙠𝙞 𝙊𝙩𝙤𝙢𝙖𝙩𝙞𝙨 𝘽𝙡𝙤𝙠𝙞𝙧 𝘽𝙖𝙜𝙞 𝙤𝙧𝙖𝙣𝙜 𝙮𝙖𝙣𝙜 𝙣𝙚𝙡𝙥𝙤𝙣 𝘽𝙤𝙩
⬡ 𝙆𝙖𝙢𝙞 𝙩𝙞𝙙𝙖𝙠 𝙗𝙚𝙧𝙩𝙖𝙣𝙜𝙜𝙪𝙣𝙜 𝙟𝙖𝙬𝙖𝙗 𝙖𝙩𝙖𝙨 𝙥𝙚𝙣𝙮𝙖𝙡𝙖𝙝𝙜𝙪𝙣𝙖𝙖𝙣 𝙗𝙤𝙩
⬡ 𝙆𝙖𝙢𝙞 𝙩𝙞𝙙𝙖𝙠 𝙗𝙚𝙧𝙩𝙖𝙣𝙜𝙜𝙪𝙣𝙜 𝙟𝙖𝙬𝙖𝙗 𝙖𝙩𝙖𝙨 𝙠𝙚𝙗𝙤𝙘𝙤𝙧𝙖𝙣 𝙙𝙖𝙩𝙖 𝙥𝙧𝙞𝙗𝙖𝙙𝙞 𝙖𝙣𝙙𝙖
⬡ 𝙐𝙨𝙚𝙧𝙨 𝙙𝙞𝙡𝙖𝙧𝙖𝙣𝙜 𝙢𝙚𝙣𝙜𝙞𝙧𝙞𝙢𝙠𝙖𝙣 𝙗𝙚𝙧𝙗𝙖𝙜𝙖𝙞 𝙗𝙪𝙜, 𝙫𝙞𝙧𝙩𝙚𝙭, 𝙙𝙡𝙡 𝙠𝙚 𝙣𝙤𝙢𝙤𝙧 𝙗𝙤𝙩.
⬡ 𝙐𝙨𝙚𝙧𝙨 𝙙𝙞𝙝𝙖𝙧𝙖𝙥 𝙩𝙞𝙙𝙖𝙠 𝙢𝙚𝙡𝙖𝙠𝙪𝙠𝙖𝙣 𝙨𝙥𝙖𝙢 𝙙𝙖𝙡𝙖𝙢 𝙥𝙚𝙣𝙜𝙜𝙪𝙣𝙖𝙖𝙣 𝙗𝙤𝙩.
⬡ 𝙐𝙨𝙚𝙧𝙨 𝙙𝙞𝙡𝙖𝙧𝙖𝙣𝙜 𝙢𝙚𝙣𝙖𝙢𝙗𝙖𝙝𝙠𝙖𝙣 𝙣𝙤𝙢𝙤𝙧 𝙗𝙤𝙩 𝙨𝙚𝙘𝙖𝙧𝙖 𝙞𝙡𝙡𝙚𝙜𝙖𝙡, 𝙪𝙣𝙩𝙪𝙠 𝙢𝙚𝙣𝙖𝙢𝙗𝙖𝙝𝙠𝙖𝙣 𝙨𝙞𝙡𝙖𝙝𝙠𝙖𝙣 𝙝𝙪𝙗𝙪𝙣𝙜𝙞 𝙤𝙬𝙣𝙚𝙧.
⬡ 𝙐𝙨𝙚𝙧𝙨 𝙙𝙞𝙝𝙖𝙧𝙖𝙥 𝙪𝙣𝙩𝙪𝙠 𝙩𝙞𝙙𝙖𝙠 𝙢𝙚𝙣𝙮𝙖𝙡𝙖𝙝 𝙜𝙪𝙣𝙖𝙠𝙖𝙣 𝙛𝙞𝙩𝙪𝙧 𝙛𝙞𝙩𝙪𝙧 𝙗𝙤𝙩.
╰═════════════════════════
╭═════〘 𝗞𝗘𝗕𝗜𝗝𝗔𝗞𝗔𝗡 𝗣𝗥𝗜𝗩𝗔𝗦𝗜 〙═══
1. ᴹᴿ𝙄𝙩𝙨𝙠𝙧𝙞 ×፝֟͜× 𝙩𝙞𝙙𝙖𝙠 𝙖𝙠𝙖𝙣 𝙢𝙚𝙧𝙚𝙠𝙖𝙢 𝙙𝙖𝙩𝙖 𝙧𝙞𝙬𝙖𝙮𝙖𝙩 𝙘𝙝𝙖𝙩 𝙪𝙨𝙚𝙧.
2. ᴹᴿ𝙄𝙩𝙨𝙠𝙧𝙞 ×፝֟͜× 𝙩𝙞𝙙𝙖𝙠 𝙖𝙠𝙖𝙣 𝙢𝙚𝙣𝙮𝙚𝙗𝙖𝙧𝙠𝙖𝙣 𝙣𝙤𝙢𝙤𝙧 𝙪𝙨𝙚𝙧𝙨.
3. ᴹᴿ𝙄𝙩𝙨𝙠𝙧𝙞 ×፝֟͜× 𝙩𝙞𝙙𝙖𝙠 𝙖𝙠𝙖𝙣 𝙢𝙚𝙣𝙮𝙞𝙢𝙥𝙖𝙣 𝙢𝙚𝙙𝙞𝙖 𝙮𝙖𝙣𝙜 𝙙𝙞𝙠𝙞𝙧𝙞𝙢𝙠𝙖𝙣 𝙤𝙡𝙚𝙝 𝙪𝙨𝙚𝙧𝙨.
4. ᴹᴿ𝙄𝙩𝙨𝙠𝙧𝙞 ×፝֟͜× 𝙩𝙞𝙙𝙖𝙠 𝙖𝙠𝙖𝙣 𝙢𝙚𝙣𝙮𝙖𝙡𝙖𝙝 𝙜𝙪𝙣𝙖𝙠𝙖𝙣 𝙙𝙖𝙩𝙖 𝙙𝙖𝙩𝙖 𝙪𝙨𝙚𝙧𝙨.
5. 𝙊𝙬𝙣𝙚𝙧 ᴹᴿ𝙄𝙩𝙨𝙠𝙧𝙞 ×፝֟͜× 𝙗𝙚𝙧𝙝𝙖𝙠 𝙢𝙚𝙡𝙞𝙝𝙖𝙩 𝙙𝙖𝙩𝙖 𝙧𝙞𝙬𝙖𝙮𝙖𝙩 𝙘𝙝𝙖𝙩 𝙪𝙨𝙚𝙧𝙨.
6. 𝙊𝙬𝙣𝙚𝙧 ᴹᴿ𝙄𝙩𝙨𝙠𝙧𝙞 ×፝֟͜× 𝙗𝙚𝙧𝙝𝙖𝙠 𝙢𝙚𝙡𝙞𝙝𝙖𝙩 𝙨𝙩𝙖𝙩𝙪𝙨 𝙪𝙨𝙚𝙧𝙨.
7. 𝙊𝙬𝙣𝙚𝙧 ᴹᴿ𝙄𝙩𝙨𝙠𝙧𝙞 ×፝֟͜× 𝙙𝙖𝙥𝙖𝙩 𝙢𝙚𝙡𝙞𝙝𝙖𝙩 𝙧𝙞𝙬𝙖𝙮𝙖𝙩 𝙘𝙝𝙖𝙩, 𝙙𝙖𝙣 𝙢𝙚𝙙𝙞𝙖 𝙮𝙖𝙣𝙜 𝙙𝙞𝙠𝙞𝙧𝙞𝙢𝙠𝙖𝙣 𝙪𝙨𝙚𝙧𝙨.
╰═════════════════════════

	`.trim()
  let message = await prepareWAMessageMedia({ image: await (await require('node-fetch')(fotonya2)).buffer()}, { upload: conn.waUploadToServer }) 
    const template = generateWAMessageFromContent(m.key.remoteJid, proto.Message.fromObject({
        templateMessage: {
            hydratedTemplate: {
                hydratedContentText: krizyn,
                imageMessage: message.imageMessage, 
           hydratedFooterText: '📮 Silahkan pilih Command Dibawah ini',
           hydratedButtons: [{
             urlButton: {
               displayText: 'GroupBot',
               url: 'https://chat.whatsapp.com/I8Q4oJVw8buHhIgMH5iVAv'
             }

           },
                {
               urlButton: {
               displayText: 'Myweb',
               url: 'https://istagram.com/zalfapontinanak'
             }

           },
               {
             quickReplyButton: {
               displayText: 'sewa',
               id: '.sewazifa',
             }
             
           },
               {
             quickReplyButton: {
               displayText: 'Menu',
               id: '.menu',
             }
             
             },
               {
             quickReplyButton: {
               displayText: 'Runtime',
               id: '.runtime',
             }

           }]
         }
       }
     }), { userJid: m.sender, quoted: m });
    //conn.reply(m.chat, text.trim(), m)
    return await conn.relayMessage(
         m.chat,
         template.message,
         { messageId: template.key.id }
     )
}

handler.tags = ['main', 'update']
handler.command = /^(rules|rule)$/i
handler.help = ['rules']
module.exports = handler
